Задание 1
Скачайте с сайта https://grouplens.org/datasets/movielens/ датасет любого размера. Определите какому фильму было выставлено больше всего оценок 5.0.

In [2]:
import pandas as pd

In [3]:
table = pd.read_csv('ratings.csv')
table

        userId  movieId  rating   timestamp
0            1        1     4.0   964982703
1            1        3     4.0   964981247
2            1        6     4.0   964982224
3            1       47     5.0   964983815
4            1       50     5.0   964982931
...        ...      ...     ...         ...
100831     610   166534     4.0  1493848402
100832     610   168248     5.0  1493850091
100833     610   168250     5.0  1494273047
100834     610   168252     5.0  1493846352
100835     610   170875     3.0  1493846415

[100836 rows x 4 columns]

In [4]:
table.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100836 entries, 0 to 100835
Data columns (total 4 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   userId     100836 non-null  int64
 1   movieId    100836 non-null  int64
 2   rating     100836 non-null  float64
 3   timestamp  100836 non-null  int64
dtypes: float64(1), int64(3)
memory usage: 3.1 MB

In [5]:
table.head()

   userId  movieId  rating  timestamp
0       1        1     4.0  964982703
1       1        3     4.0  964981247
2       1        6     4.0  964982224
3       1       47     5.0  964983815
4       1       50     5.0  964982931

In [6]:
table.tail(10)

        userId  movieId  rating   timestamp
100826     610   162350     3.5  1493849971
100827     610   163937     3.5  1493848789
100828     610   163981     3.5  1493850155
100829     610   164179     5.0  1493845631
100830     610   166528     4.0  1493879365
100831     610   166534     4.0  1493848402
100832     610   168248     5.0  1493850091
100833     610   168250     5.0  1494273047
100834     610   168252     5.0  1493846352
100835     610   170875     3.0  1493846415

In [7]:
len(table)

100836

In [8]:
table.shape

(100836, 4)

In [9]:
table['ewwss'] = table['userId'] /1000

In [10]:
table.tail()

        userId  movieId  rating   timestamp  ewwss
100831     610   166534     4.0  1493848402   0.61
100832     610   168248     5.0  1493850091   0.61
100833     610   168250     5.0  1494273047   0.61
100834     610   168252     5.0  1493846352   0.61
100835     610   170875     3.0  1493846415   0.61

In [11]:
table['timestamp'].head()

0    964982703
1    964981247
2    964982224
3    964983815
4    964982931
Name: timestamp, dtype: int64

In [12]:
table.rating.nunique()

10

In [13]:
table.head()

   userId  movieId  rating  timestamp  ewwss
0       1        1     4.0  964982703  0.001
1       1        3     4.0  964981247  0.001
2       1        6     4.0  964982224  0.001
3       1       47     5.0  964983815  0.001
4       1       50     5.0  964982931  0.001

In [14]:
table.userId.value_counts()

414    2698
599    2478
474    2108
448    1864
274    1346
       ...
406      20
595      20
569      20
431      20
442      20
Name: userId, Length: 610, dtype: int64

In [15]:
table.movieId.nunique()

9724

In [16]:
table.rating.mean()

3.501556983616962

In [17]:
len(table[table['rating'] == 5.0])

13211